// ============================================================================
// FILE:
// /app/ranking/components/EmptyRanking.tsx
// Copyright (c) 2024 Shin Corporation.
// All rights reserved.
// ============================================================================

'use client'

/* ============================================================================
🔥 Styles
============================================================================ */

import styles
    from '../../styles/ranking.module.css'

/* ============================================================================
🔥 Empty Ranking
============================================================================ */

export default function EmptyRanking() {

    return (

        <section
            className={
                styles.emptyRanking
            }
        >

            {/* ==========================================================
            Title
            ========================================================== */}

            <h2
                className={
                    styles.emptyRankingTitle
                }
            >

                公開中のランキングはありません

            </h2>

            {/* ==========================================================
            Description
            ========================================================== */}

            <p
                className={
                    styles.emptyRankingText
                }
            >

                現在表示できるランキングはありません。

                <br />

                新しいランキングが公開されるまで、
                しばらくお待ちください。

            </p>

        </section>

    )

}