# -*- coding: utf-8 -*-
# /home/maya/dev/shin-vps/django/api/urls/linkshare_urls.py

from django.urls import path

# ==============================================================================
# 🚀 Namespace
# ==============================================================================

app_name = "linkshare"

# ==============================================================================
# 🚀 URL Patterns
# ==============================================================================

urlpatterns = [

    # TODO:
    # LinkShare API View 実装後に有効化

]